driver-tests/httpsoapbc/xslt/HelloJbi/test/Testcase0/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.hello/">
  <soapenv:Body>
    <ser:sayHelloRequest>
      <!--Optional:-->
      <name>Bala</name>
    </ser:sayHelloRequest>
  </soapenv:Body>
</soapenv:Envelope>